DataProcessors/МобильноеРабочееМестоКладовщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МобильноеРабочееМестоКладовщика</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ПересчетТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПересчетТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварныеМестаКОтражениюИзлишковНедостач</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</xr:Item>
				<xr:Item>InformationRegister.БлокировкиСкладскихЯчеек</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыИПотребности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПересчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПересчетовТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьКоличествоПоУчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныеДанныеЗаполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаКонсолидацииИзлишковТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаКонсолидацииИспорченныхТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтдельнуюЯчейкуИзлишков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтдельнуюЯчейкуПорчи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьЯчейки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзлишекПорча</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролируемаяПартия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПодтвержденияКачества</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодлежитРазблокировке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/УпаковкиЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УпаковкиЕдиницыИзмерения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НаборыУпаковок</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Безразмерная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глубина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Числитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Знаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинейныеРазмерыПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеГруппыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипоразмерыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставляетсяВМногооборотнойТаре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураМногооборотнаяТара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаМногооборотнаяТара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальноеКоличествоУпаковокМногооборотнойТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИзмеряемойВеличины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИзмеряемыхВеличин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународноеСокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУпаковокНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/МобильноеРабочееМестоКладовщика/Forms/ПересчетТоваров/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Ссылка = Параметры.Ссылка;
	ПоказыватьФотоТоваров = Параметры.ПоказыватьФотоТоваров;
	Штрихкод = Параметры.Штрихкод;
	ПорядокСканирования = Параметры.ПорядокСканирования;
	
	ЗаполнитьФорму();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"] Тогда
		
		СтандартнаяОбработка = Ложь;   
		Отказ = Истина;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаКПоступлению"];
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИспользуемыйСерверФормы = ИспользуемыйСервер.Основной Тогда
		// ПодключаемоеОборудование
		Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда 
			
			ЕстьНеобработанноеСобытие = МобильноеРабочееМестоКладовщикаКлиент.ЕстьНеобработанноеСобытие();
			
			Если ИмяСобытия = "ScanData" И ЕстьНеобработанноеСобытие Тогда
				
				Данные = МобильноеРабочееМестоКладовщикаКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
				
				ОбработатьШтрихкод(Данные);

			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Информация(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"];
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Описание = Новый ОписаниеОповещения("ОбновитьФорму", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Элемент.ТекущиеДанные.Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", Элемент.ТекущиеДанные.Характеристика);
	ПараметрыФормы.Вставить("Серия", Элемент.ТекущиеДанные.Серия);
	ПараметрыФормы.Вставить("Назначение", Элемент.ТекущиеДанные.Назначение);
	ПараметрыФормы.Вставить("Упаковка", Элемент.ТекущиеДанные.Упаковка);
	ПараметрыФормы.Вставить("Количество", Элемент.ТекущиеДанные.КоличествоУпаковокФакт);
	ПараметрыФормы.Вставить("Режим", "РедактированиеПересчет");
	ПараметрыФормы.Вставить("НомерСтроки", Элемент.ТекущаяСтрока);
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("Помещение", Помещение);
	ПараметрыФормы.Вставить("Ячейка", Элемент.ТекущиеДанные.Ячейка);
	ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
	ПараметрыФормы.Вставить("Артикул", Элемент.ТекущиеДанные.Артикул);
	ПараметрыФормы.Вставить("ДокументИсточник", Ссылка);
	ПараметрыФормы.Вставить("ШтрихкодДокумента", Штрихкод);
	ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);

	ОткрытьФорму(
	"Обработка.МобильноеРабочееМестоКладовщика.Форма.КарточкаТовара",ПараметрыФормы,
	ЭтотОбъект,,,,Описание,
	РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьПересчет(Команда)
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить("Завершить", НСтр("ru = 'Завершить'"));
	СписокЗначений.Добавить("Продолжить", НСтр("ru = 'Продолжить'"));
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Закончить пересчет?'"), СписокЗначений, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура Сканировать(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("Помещение", Помещение);
	ПараметрыФормы.Вставить("ДокументСсылка", Ссылка);
	ПараметрыФормы.Вставить("Режим", "Пересчет");
	
	Если ИспользоватьАдресноеХранение Тогда 
		
		ПараметрыФормы.Вставить("ТипПоиска", "ПоискЯчейки");
		Описание = Новый ОписаниеОповещения("РезультатСканированияЯчейки", ЭтотОбъект);
		
	Иначе
		
		ПараметрыФормы.Вставить("ТипПоиска", "ПоискНоменклатуры");
		Описание = Новый ОписаниеОповещения("РезультатСканированияТовара", ЭтотОбъект);
		
	КонецЕсли;
	
	Если ИспользуемыйСерверФормы = ИспользуемыйСервер.Основной Тогда
		ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.СканированиеШтрихкода",ПараметрыФормы,
		ЭтотОбъект,,,, Описание,
		РежимОткрытияОкнаФормы.Независимый);
	Иначе
		ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.СканированиеШтрихкодаАвтономныйРежим",ПараметрыФормы,
		ЭтотОбъект,,,, Описание,
		РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКоличествоУпаковокРазница.Имя);
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.КоличествоУпаковокРазница");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 0;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаПроблема);
	
	Элементы.ТоварыЯчейка.Видимость = ИспользоватьАдресноеХранение;
	
	Элементы.ТоварыКоличествоУпаковок.Видимость = ПечататьКоличествоПоУчету;
	Элементы.ТоварыКоличествоУпаковокРазница.Видимость = ПечататьКоличествоПоУчету;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПересчетТоваров.Номер КАК Номер,
		|	ПересчетТоваров.Дата КАК Дата,
		|	ПересчетТоваров.Исполнитель КАК Исполнитель,
		|	ПересчетТоваров.Комментарий КАК Комментарий,
		|	ПересчетТоваров.Помещение КАК Помещение,
		|	ПересчетТоваров.Склад КАК Склад,
		|	ПересчетТоваров.ПечататьКоличествоПоУчету КАК ПечататьКоличествоПоУчету,
		|	ВЫБОР
		|		КОГДА ПересчетТоваров.Склад.ИспользоватьСкладскиеПомещения
		|			ТОГДА ПересчетТоваров.Помещение.ИспользоватьАдресноеХранение
		|		ИНАЧЕ ПересчетТоваров.Склад.ИспользоватьАдресноеХранение
		|	КОНЕЦ КАК ИспользоватьАдресноеХранение,
		|	ПересчетТоваров.Товары.(
		|		Количество КАК Количество,
		|		КоличествоФакт КАК КоличествоФакт,
		|		КоличествоУпаковок КАК КоличествоУпаковок,
		|		КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
		|		Номенклатура КАК Номенклатура,
		|		Номенклатура.Артикул КАК Артикул,
		|		ВЫБОР
		|			КОГДА Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|				ТОГДА Номенклатура.ЕдиницаИзмерения
		|			ИНАЧЕ Упаковка
		|		КОНЕЦ КАК Упаковка,
		|		Характеристика КАК Характеристика,
		|		Назначение КАК Назначение,
		|		Ячейка КАК Ячейка,
		|		Серия КАК Серия,
		|		СтатусУказанияСерий КАК СтатусУказанияСерий,
		|		КоличествоУпаковокФакт - КоличествоУпаковок КАК КоличествоУпаковокРазница,
		|		КоличествоФакт - Количество КАК КоличествоРазница
		|	) КАК ТаблицаТовары
		|ИЗ
		|	Документ.ПересчетТоваров КАК ПересчетТоваров
		|ГДЕ
		|	ПересчетТоваров.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаДетальныеЗаписи);
	
	Товары.Загрузить(ВыборкаДетальныеЗаписи.ТаблицаТовары.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьФормуНаСервере(Результат);
	Если ЗначениеЗаполнено(Результат.ДанныеСледующегоТовара) Тогда
		РезультатСканированияТовара(Результат.ДанныеСледующегоТовара);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФормуНаСервере(Результат)
	
	КоэффициентУпаковки = МобильноеРабочееМестоКладовщика.КоэффициентУпаковки(Результат.Упаковка, Результат.Номенклатура);
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура", Результат.Номенклатура);
	СтруктураПоиска.Вставить("Характеристика", Результат.Характеристика);
	СтруктураПоиска.Вставить("Серия", Результат.Серия);
	СтруктураПоиска.Вставить("Упаковка", Результат.Упаковка);
	СтруктураПоиска.Вставить("Назначение", Результат.Назначение);
	СтруктураПоиска.Вставить("Ячейка", Результат.Ячейка);
			
	РезультатПоиска = Товары.НайтиСтроки(СтруктураПоиска);
	Если РезультатПоиска.Количество() > 0 Тогда
		
		Если Результат.Режим = "РедактированиеПересчет" Тогда
			РезультатПоиска[0].КоличествоУпаковокФакт = Результат.КоличествоУпаковок;
		Иначе
			РезультатПоиска[0].КоличествоУпаковокФакт = РезультатПоиска[0].КоличествоУпаковокФакт + Результат.КоличествоУпаковок;
		КонецЕсли;

		РезультатПоиска[0].КоличествоФакт = РезультатПоиска[0].КоличествоУпаковокФакт * КоэффициентУпаковки;
		
		РезультатПоиска[0].КоличествоУпаковокРазница = РезультатПоиска[0].КоличествоУпаковокФакт - РезультатПоиска[0].КоличествоУпаковок;
		РезультатПоиска[0].КоличествоРазница = РезультатПоиска[0].КоличествоУпаковокРазница * КоэффициентУпаковки;
		
	Иначе
		
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат,,"КоличествоУпаковок");
		НоваяСтрока.КоличествоУпаковокФакт = Результат.КоличествоУпаковок;
		НоваяСтрока.КоличествоФакт = Результат.КоличествоУпаковок * КоэффициентУпаковки;
		НоваяСтрока.КоличествоУпаковокРазница = НоваяСтрока.КоличествоУпаковокФакт;
		НоваяСтрока.КоличествоРазница = НоваяСтрока.КоличествоУпаковокРазница * КоэффициентУпаковки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗакончитьПересчетНаСервере()
	
	ШаблонОшибкиЗаписать = НСтр("ru = 'Не удалось записать %1. %2'");
	
	ДокументОбъект = Ссылка.ПолучитьОбъект();
	
	ДокументОбъект.Статус      = Перечисления.СтатусыПересчетовТоваров.Выполнено;
	ДокументОбъект.Помещение   = Помещение;
	ДокументОбъект.Комментарий = Комментарий;
	ДокументОбъект.Исполнитель = Исполнитель;
	
	ДокументОбъект.Товары.Очистить();
	
	Если МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(Склад, "ИспользоватьСкладскиеПомещения")
		И Помещение.Пустая() Тогда
		
		ТекстОшибки = НСтр("ru = 'Не выбрано помещение'");
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"];
		Возврат Ложь;
		
	КонецЕсли;
		
	Для Каждого Строка Из Товары Цикл
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Если Строка.КоличествоУпаковокРазница <> 0 Тогда
			НоваяСтрока.ИзлишекПорча = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыУказанияСерий = Документы.ПересчетТоваров.ПараметрыУказанияСерий(ДокументОбъект);
	МобильноеРабочееМестоКладовщика.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий);
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		ТекстОшибки = СтрШаблон(ШаблонОшибкиЗаписать, Ссылка,
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ДанныеЯчейкиПоШК(Знач Штрихкод)
	
	Возврат Обработки.МобильноеРабочееМестоКладовщика.ДанныеЯчейкиПоШК(Склад, Помещение, Штрихкод);
	
КонецФункции 

&НаСервереБезКонтекста
Функция ДанныеТоваровПоШК(Штрихкод)
	
	Возврат Обработки.МобильноеРабочееМестоКладовщика.ДанныеТоваровПоШК(Штрихкод);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = "Завершить" Тогда
		
		ПриемкаЗавершена = ЗакончитьПересчетНаСервере();
		
		Если ПриемкаЗавершена Тогда
			Закрыть();
		Иначе
			Состояние(ТекстОшибки);
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(ДанныеШтрихкода)
		
	ШтрихкодыВалидны = МобильноеРабочееМестоКладовщикаКлиент.ШтрихкодыВалидны(ДанныеШтрихкода);
	
	Если Не ШтрихкодыВалидны Тогда
		Возврат;
	КонецЕсли;
	
	Если Штрихкод = ДанныеШтрихкода.Штрихкод Тогда  
				
		ПересчетЗавершен = ЗакончитьПересчетНаСервере();
		
		Если ПересчетЗавершен Тогда
			Закрыть();
		Иначе
			Состояние(ТекстОшибки);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	СначалаПоискЯчейки = (ПорядокСканирования = "СначалаСканированиеЯчейки");

	Если ИспользоватьАдресноеХранение Тогда
	
		Если СначалаПоискЯчейки Тогда
			
			ДанныеЯчейки = ДанныеЯчейкиПоШК(ДанныеШтрихкода.Штрихкод); 
			
			Если ЗначениеЗаполнено(ДанныеЯчейки.Ячейка) Тогда
				РезультатСканированияЯчейки(ДанныеЯчейки);
				Возврат;
			КонецЕсли;
					
			Состояние(НСтр("ru = 'Ячейка по штрихкоду не найдена'"));
		Иначе
			ДанныеТоваров = ДанныеТоваровПоШК(ДанныеШтрихкода.Штрихкод); 
		
			Если ЗначениеЗаполнено(ДанныеТоваров) Тогда
				РезультатСканированияТовара(ДанныеТоваров);
				Возврат;
			КонецЕсли;
			
			Состояние(НСтр("ru = 'Номенклатура по штрихкоду не найдена'"));
		КонецЕсли; 
		
	Иначе 
		
		ДанныеТоваров = ДанныеТоваровПоШК(ДанныеШтрихкода.Штрихкод);
			
		Если ЗначениеЗаполнено(ДанныеТоваров) Тогда
			РезультатСканированияТовара(ДанныеТоваров);
			Возврат;
		КонецЕсли;
		
		Состояние(НСтр("ru = 'Номенклатура по штрихкоду не найдена'"));
			
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура РезультатСканированияТовара(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Количество() > 1 Тогда 
		
		Описание = Новый ОписаниеОповещения("РезультатСканированияТовара", ЭтотОбъект);
		
		ЗначенияЗаполнения = Новый Структура;		
		ЗначенияЗаполнения.Вставить("Товары", Результат);
		ЗначенияЗаполнения.Вставить("Режим", "ВыборНоменклатуры");
		ЗначенияЗаполнения.Вставить("Штрихкод", "");
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РезультатСканирования", ЗначенияЗаполнения);
		
		ОткрытьФорму(
			"Обработка.МобильноеРабочееМестоКладовщика.Форма.ФормаВыбораСканирование", ПараметрыФормы,
			ЭтотОбъект,,,,Описание, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	Иначе
		
		ДанныеТовара = Результат[0];
		
		Если ПорядокСканирования = "СначалаСканированиеЯчейки" Тогда
			Описание = Новый ОписаниеОповещения("ОбновитьФорму", ЭтотОбъект);
		Иначе
			Описание = Новый ОписаниеОповещения("ДобавитьТовар", ЭтотОбъект);
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Номенклатура", ДанныеТовара.Номенклатура);
		ПараметрыФормы.Вставить("Характеристика", ДанныеТовара.Характеристика);
		ПараметрыФормы.Вставить("Серия", ДанныеТовара.Серия);
		ПараметрыФормы.Вставить("Упаковка", ДанныеТовара.Упаковка);
		ПараметрыФормы.Вставить("Количество", ДанныеТовара.Количество);
		ПараметрыФормы.Вставить("Режим", "Пересчет");
		ПараметрыФормы.Вставить("НомерСтроки", 0);
		ПараметрыФормы.Вставить("Склад", Склад);
		ПараметрыФормы.Вставить("Помещение", Помещение); 
		ПараметрыФормы.Вставить("Источник", Ссылка);
		ПараметрыФормы.Вставить("ШтрихкодУпаковки", ДанныеТовара.ШтрихкодУпаковки);
		ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
		ПараметрыФормы.Вставить("ШтрихкодДокумента", Штрихкод);
		ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);

		ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.КарточкаТовара",ПараметрыФормы,
		ЭтотОбъект,,,,Описание,
		РежимОткрытияОкнаФормы.Независимый); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатСканированияЯчейки(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Описание = Новый ОписаниеОповещения("ЗавершитьПересчетВЯчейке", ЭтотОбъект);
	
	ТоварыВЯчейке = Новый Массив;
	
	Для Каждого Строка Из Товары Цикл
		
		Если Строка.Ячейка = Результат.Ячейка Тогда
			
			Структура = СтруктураТоваров();
			ЗаполнитьЗначенияСвойств(Структура, Строка);
			Структура.КоличествоУпаковокРазмещено = Строка.КоличествоУпаковокФакт;
			
			ТоварыВЯчейке.Добавить(Структура);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ячейка",      Результат.Ячейка);
	ПараметрыФормы.Вставить("Товары",      ТоварыВЯчейке);
	ПараметрыФормы.Вставить("Склад",       Склад);
	ПараметрыФормы.Вставить("Помещение",   Помещение);
	ПараметрыФормы.Вставить("ТипОперации", 4);
	ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
	ПараметрыФормы.Вставить("Ссылка", Ссылка);
	ПараметрыФормы.Вставить("ШтрихкодДокумента", Штрихкод);
	ПараметрыФормы.Вставить("ШтрихкодЯчейки", Результат.Штрихкод);
	ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);
	ПараметрыФормы.Вставить("Режим", "РедактированиеПересчет");
	ПараметрыФормы.Вставить("ПечататьКоличествоПоУчету", ПечататьКоличествоПоУчету);
	
	ОткрытьФорму(
	"Обработка.МобильноеРабочееМестоКладовщика.Форма.РазмещениеВЯчейки",ПараметрыФормы,
	ЭтотОбъект,,,,Описание,
	РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТовар(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ДобавитьТоварНаСервере(Результат);
	
	Если Результат = Неопределено Тогда		
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
		Состояние(ТекстОшибки); 
	КонецЕсли;

	Если ЗначениеЗаполнено(Результат.ДанныеСледующегоТовара) Тогда
		РезультатСканированияТовара(Результат.ДанныеСледующегоТовара);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьТоварНаСервере(Знач Результат)
	
	СтруктураПоиска = Новый Структура;
	
	Если Результат = Неопределено Тогда
		
		СтруктураПоиска.Вставить("Ячейка", Справочники.СкладскиеЯчейки.ПустаяСсылка());		
		РезультатПоиска = Товары.НайтиСтроки(СтруктураПоиска);
		Для Каждого Строка Из РезультатПоиска Цикл
			Товары.Удалить(Строка);
		КонецЦикла;
		
		Возврат;
	КонецЕсли; 
		
	Если Не ЗначениеЗаполнено(Результат.Ячейка) И Не ЗначениеЗаполнено(Результат.ДанныеСледующейЯчейки) Тогда
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат); 
		Возврат;
	КонецЕсли;
	
	МассивПересчета = Новый Массив; 
	
	Если ЗначениеЗаполнено(Результат.Ячейка) Тогда
		Ячейка = Результат.Ячейка;		
	ИначеЕсли ЗначениеЗаполнено(Результат.ДанныеСледующейЯчейки) Тогда
		Ячейка = Результат.ДанныеСледующейЯчейки.Ячейка;
	КонецЕсли;

	Структура = СтруктураТоваровПересчета();
	ЗаполнитьЗначенияСвойств(Структура, Результат);
	Структура.Ячейка = Ячейка;
	МассивПересчета.Добавить(Структура); 
	
	Если Не ЗначениеЗаполнено(Результат.ДанныеСледующегоТовара) Тогда
		СтруктураПоиска.Вставить("Ячейка", Справочники.СкладскиеЯчейки.ПустаяСсылка());		
		РезультатПоиска = Товары.НайтиСтроки(СтруктураПоиска); 
			
		Для Каждого Строка Из РезультатПоиска Цикл
			Структура = СтруктураТоваровПересчета();
			Строка.Ячейка = Ячейка;
			ЗаполнитьЗначенияСвойств(Структура, Строка); 
			МассивПересчета.Добавить(Структура);
		КонецЦикла;
			
		Для Каждого Строка Из РезультатПоиска Цикл
			Товары.Удалить(Строка);
		КонецЦикла;
	КонецЕсли;
		 
	Для Каждого СтрокаЯчейки Из МассивПересчета Цикл
		
		СтрокаЯчейки.Вставить("Режим", Результат.Режим);
		ОбновитьФормуНаСервере(СтрокаЯчейки);
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПересчетВЯчейке(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаЯчейки Из Результат.МассивРазмещений Цикл
		
		СтрокаЯчейки.Вставить("Режим", Результат.Режим);
		ОбновитьФормуНаСервере(СтрокаЯчейки);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Результат.ДанныеСледующейЯчейки) Тогда
		РезультатСканированияЯчейки(Результат.ДанныеСледующейЯчейки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция СтруктураТоваров()
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура","");
	Структура.Вставить("Характеристика","");
	Структура.Вставить("Серия","");
	Структура.Вставить("Упаковка","");
	Структура.Вставить("КоличествоУпаковок","");
	Структура.Вставить("Назначение","");
	Структура.Вставить("КоличествоУпаковокРазмещено","");
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция СтруктураТоваровПересчета()
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура","");
	Структура.Вставить("Характеристика","");
	Структура.Вставить("Серия","");
	Структура.Вставить("Назначение","");
	Структура.Вставить("Упаковка","");
	Структура.Вставить("УпаковкаРазмещено","");
	Структура.Вставить("КоличествоУпаковок","");
	Структура.Вставить("КоличествоУпаковокРазмещено","");
	Структура.Вставить("Ячейка","");
	Структура.Вставить("ЯчейкаЗамена","");
	Структура.Вставить("НомерСтроки","");
	
	Возврат Структура;
	
КонецФункции 

#КонецОбласти
